orgs/cocos2dx-fileutils-cache.org
#+HUGO_BASE_DIR: ../
#+TITLE: cocos2dx FileUtils 缓存机制
#+DATE: <2017-05-12 Fri 15:36>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: cocos2dx FileUtils
#+HUGO_CATEGORIES: 笔记
#+HUGO_SECTION: post
#+HUGO_DRAFT: false
#+OPTIONS: toc:2  ^:nil author:nil num:2




* 背景
处理热lua更新功能
* 问题
有些文件没有没有获取最新下载的资源，依然是使用旧的
* 思路及解决
** 首先查看搜索路径
#+BEGIN_SRC lua
dump(cc.FileUtils:getInstance():getSearchPaths())
-- 结果是没有问题的
#+END_SRC
** 路径缓存起来

#+BEGIN_SRC C++
std::string FileUtils::fullPathForFilename(const std::string &filename) const
{
    if (filename.empty())
    {
        return "";
    }

    if (isAbsolutePath(filename))
    {
        return filename;
    }

    // Already Cached ?
    auto cacheIter = _fullPathCache.find(filename);
    if(cacheIter != _fullPathCache.end())
    {
        return cacheIter->second;
    }

    // Get the new file name.
    const std::string newFilename( getNewFilename(filename) );

    std::string fullpath;

    for (const auto& searchIt : _searchPathArray)
    {
        for (const auto& resolutionIt : _searchResolutionsOrderArray)
        {
            fullpath = this->getPathForFilename(newFilename, resolutionIt, searchIt);

            if (!fullpath.empty())
            {
                // Using the filename passed in as key.
                _fullPathCache.insert(std::make_pair(filename, fullpath));
                return fullpath;
            }

        }
    }

    if(isPopupNotify()){
        CCLOG("cocos2d: fullPathForFilename: No file found at %s. Possible missing file.", filename.c_str());
    }

    // The file wasn't found, return empty string.
    return "";
}

#+END_SRC
* 结果
完美解决
 
